; domain
;; The sliding-tile puzzle.
;;
;; Tile positions are encoded by the predicate
;;     (tile-at <tile> <row> <col>).
;;
;; Blank position is encoded by the predicate
;;     (is-blank <row> <col>).
;;
;; This simplest level of PDDL does not know about
;; numbers, so we tell it which rows/columns follow
;; which other rows/columns with static predicates
;;     (NEXT-ROW ?r1 ?r2)
;;     (NEXT-COLUMN ?c1 ?c2)
;;
;; There are also static predicates for encoding tiles,
;; rows and columns, which are not strictly necessary but
;; may help with readability.


(define (domain sliding-tile)

  (:requirements :strips)

  (:predicates
   (IS-TILE ?x)
   (IS-ROW ?x)
   (IS-COLUMN ?x)
   (NEXT-ROW ?r1 ?r2)
   (NEXT-COLUMN ?c1 ?c2)
   (tile-at ?t ?r ?c)
   (is-blank ?r ?c)
   (is-removed ?x)
   (tile-removed)
   )
  

  (:action remove-tile
      :parameters (?tile ?row ?col)
      :precondition (and (IS-TILE ?tile)
                      (IS-ROW ?row) 
                      (IS-COLUMN ?col)
                      (not (is-removed ?tile))
                      (tile-at ?tile ?row ?col)
                      (not(tile-removed)))
      :effect (and (is-blank ?row ?col)
                  (is-removed ?tile) ;remove a certain tile
                  (not (tile-at ?tile ?row ?col)) ; the tile is no more at the row,col position
                  (tile-removed))) ;set tile-removed to true, no other tile can be removed unless it is reinserted
  
  (:action reinsert-tile
      :parameters (?tile ?row ?col)
      :precondition (and (IS-TILE ?tile)
                      (IS-ROW ?row) 
                      (IS-COLUMN ?col)
                      (is-removed ?tile)
                      (not (tile-at ?tile ?row ?col))
                      (is-blank ?row ?col)
                      (tile-removed)
                      )
      :effect (and (not(is-blank ?row ?col))
                  (not(is-removed ?tile))
                  (tile-at ?tile ?row ?col) ;insert tile previously removed
                  (not(tile-removed)))) ;allow to remove other tile
  
  
  
  (:action move-tile-down
    :parameters (?tile ?old-row ?new-row ?col)
    :precondition (and (IS-TILE ?tile)
                       (IS-ROW ?old-row)
                       (IS-ROW ?new-row)
                       (IS-COLUMN ?col)
                       (NEXT-ROW ?old-row ?new-row)
                       (tile-at ?tile ?old-row ?col)
                       (is-blank ?new-row ?col))
    :effect (and (not (tile-at ?tile ?old-row ?col))
                 (not (is-blank ?new-row ?col))
                 (tile-at ?tile ?new-row ?col)
                 (is-blank ?old-row ?col)))

  (:action move-tile-up
    :parameters (?tile ?old-row ?new-row ?col)
    :precondition (and (IS-TILE ?tile)
                       (IS-ROW ?old-row)
                       (IS-ROW ?new-row)
                       (IS-COLUMN ?col)
                       (NEXT-ROW ?new-row ?old-row)
                       (tile-at ?tile ?old-row ?col)
                       (is-blank ?new-row ?col))
    :effect (and (not (tile-at ?tile ?old-row ?col))
                 (not (is-blank ?new-row ?col))
                 (tile-at ?tile ?new-row ?col)
                 (is-blank ?old-row ?col)))

  (:action move-tile-right
    :parameters (?tile ?row ?old-col ?new-col)
    :precondition (and (IS-TILE ?tile)
                       (IS-ROW ?row)
                       (IS-COLUMN ?old-col)
                       (IS-COLUMN ?new-col)
                       (NEXT-COLUMN ?old-col ?new-col)
                       (tile-at ?tile ?row ?old-col)
                       (is-blank ?row ?new-col))
    :effect (and (not (tile-at ?tile ?row ?old-col))
                 (not (is-blank ?row ?new-col))
                 (tile-at ?tile ?row ?new-col)
                 (is-blank ?row ?old-col)))

  (:action move-tile-left
    :parameters (?tile ?row ?old-col ?new-col)
    :precondition (and (IS-TILE ?tile)
                       (IS-ROW ?row)
                       (IS-COLUMN ?old-col)
                       (IS-COLUMN ?new-col)
                       (NEXT-COLUMN ?new-col ?old-col)
                       (tile-at ?tile ?row ?old-col)
                       (is-blank ?row ?new-col))
    :effect (and (not (tile-at ?tile ?row ?old-col))
                 (not (is-blank ?row ?new-col))
                 (tile-at ?tile ?row ?new-col)
                 (is-blank ?row ?old-col)))

  )

; problem
;; Fifteen puzzle example task.

(define (problem fifteen-puzzle-example)

  (:domain sliding-tile)

  (:objects
   tile1 tile2 tile3 tile4 tile5
   tile6 tile7 tile8 tile9 tile10
   tile11 tile12 tile13 tile14 tile15
   row1 row2 row3 row4
   col1 col2 col3 col4)

  (:init
   (IS-TILE tile1)
   (IS-TILE tile2)
   (IS-TILE tile3)
   (IS-TILE tile4)
   (IS-TILE tile5)
   (IS-TILE tile6)
   (IS-TILE tile7)
   (IS-TILE tile8)
   (IS-TILE tile9)
   (IS-TILE tile10)
   (IS-TILE tile11)
   (IS-TILE tile12)
   (IS-TILE tile13)
   (IS-TILE tile14)
   (IS-TILE tile15)
   (IS-ROW row1)
   (IS-ROW row2)
   (IS-ROW row3)
   (IS-ROW row4)
   (NEXT-ROW row1 row2)
   (NEXT-ROW row2 row3)
   (NEXT-ROW row3 row4)
   (IS-COLUMN col1)
   (IS-COLUMN col2)
   (IS-COLUMN col3)
   (IS-COLUMN col4)
   (NEXT-COLUMN col1 col2)
   (NEXT-COLUMN col2 col3)
   (NEXT-COLUMN col3 col4)

   ;; initial state: first (top) row, left-to-right
   (tile-at tile9 row1 col1)
   (tile-at tile2 row1 col2)
   (tile-at tile12 row1 col3)
   (tile-at tile7 row1 col4)
   ;; initial state: second row, left-to-right
   (tile-at tile5 row2 col1)
   (tile-at tile6 row2 col2)
   (tile-at tile14 row2 col3)
   (tile-at tile13 row2 col4)
   ;; initial state: third row, left-to-right
   (tile-at tile3 row3 col1)
   (is-blank row3 col2)
   (tile-at tile11 row3 col3)
   (tile-at tile1 row3 col4)
   ;; initial state: fourth (bottom) row, left-to-right
   (tile-at tile15 row4 col1)
   (tile-at tile4 row4 col2)
   (tile-at tile10 row4 col3)
   (tile-at tile8 row4 col4)
   )

  ;; goal state
  (:goal
   (and
    (tile-at tile1 row1 col1)
    (tile-at tile2 row1 col2)
    (tile-at tile3 row1 col3)
    (tile-at tile4 row1 col4)
    (tile-at tile5 row2 col1)
    (tile-at tile6 row2 col2)
    (tile-at tile7 row2 col3)
    (tile-at tile8 row2 col4)
    (tile-at tile9 row3 col1)
    (tile-at tile10 row3 col2)
    (tile-at tile11 row3 col3)
    (tile-at tile12 row3 col4)
    (tile-at tile13 row4 col1)
    (tile-at tile14 row4 col2)
    (tile-at tile15 row4 col3)))
  )

; plan
1. (move-tile-up tile4 row4 row3 col2)
   deleted: (tile-at tile4 row4 col2) (is-blank row3 col2)
   added: (tile-at tile4 row3 col2) (is-blank row4 col2)
   goals met: 4 of 15
2. (remove-tile tile13 row2 col4)
   deleted: (tile-at tile13 row2 col4)
   added: (is-blank row2 col4) (is-removed tile13) (tile-removed)
   goals met: 4 of 15
3. (reinsert-tile tile13 row4 col2)
   deleted: (is-blank row4 col2) (is-removed tile13) (tile-removed)
   added: (tile-at tile13 row4 col2)
   goals met: 4 of 15
4. (move-tile-down tile7 row1 row2 col4)
   deleted: (tile-at tile7 row1 col4) (is-blank row2 col4)
   added: (tile-at tile7 row2 col4) (is-blank row1 col4)
   goals met: 4 of 15
5. (move-tile-right tile12 row1 col3 col4)
   deleted: (tile-at tile12 row1 col3) (is-blank row1 col4)
   added: (tile-at tile12 row1 col4) (is-blank row1 col3)
   goals met: 4 of 15
6. (move-tile-up tile14 row2 row1 col3)
   deleted: (tile-at tile14 row2 col3) (is-blank row1 col3)
   added: (tile-at tile14 row1 col3) (is-blank row2 col3)
   goals met: 4 of 15
7. (move-tile-left tile7 row2 col4 col3)
   deleted: (tile-at tile7 row2 col4) (is-blank row2 col3)
   added: (tile-at tile7 row2 col3) (is-blank row2 col4)
   goals met: 5 of 15
8. (move-tile-down tile12 row1 row2 col4)
   deleted: (tile-at tile12 row1 col4) (is-blank row2 col4)
   added: (tile-at tile12 row2 col4) (is-blank row1 col4)
   goals met: 5 of 15
9. (remove-tile tile13 row4 col2)
   deleted: (tile-at tile13 row4 col2)
   added: (is-blank row4 col2) (is-removed tile13) (tile-removed)
   goals met: 5 of 15
10. (reinsert-tile tile13 row1 col4)
   deleted: (is-blank row1 col4) (is-removed tile13) (tile-removed)
   added: (tile-at tile13 row1 col4)
   goals met: 5 of 15
11. (remove-tile tile1 row3 col4)
   deleted: (tile-at tile1 row3 col4)
   added: (is-blank row3 col4) (is-removed tile1) (tile-removed)
   goals met: 5 of 15
12. (move-tile-down tile12 row2 row3 col4)
   deleted: (tile-at tile12 row2 col4) (is-blank row3 col4)
   added: (tile-at tile12 row3 col4) (is-blank row2 col4)
   goals met: 6 of 15
13. (reinsert-tile tile1 row2 col4)
   deleted: (is-blank row2 col4) (is-removed tile1) (tile-removed)
   added: (tile-at tile1 row2 col4)
   goals met: 6 of 15
14. (remove-tile tile14 row1 col3)
   deleted: (tile-at tile14 row1 col3)
   added: (is-blank row1 col3) (is-removed tile14) (tile-removed)
   goals met: 6 of 15
15. (reinsert-tile tile14 row4 col2)
   deleted: (is-blank row4 col2) (is-removed tile14) (tile-removed)
   added: (tile-at tile14 row4 col2)
   goals met: 7 of 15
16. (remove-tile tile3 row3 col1)
   deleted: (tile-at tile3 row3 col1)
   added: (is-blank row3 col1) (is-removed tile3) (tile-removed)
   goals met: 7 of 15
17. (reinsert-tile tile3 row1 col3)
   deleted: (is-blank row1 col3) (is-removed tile3) (tile-removed)
   added: (tile-at tile3 row1 col3)
   goals met: 8 of 15
18. (remove-tile tile13 row1 col4)
   deleted: (tile-at tile13 row1 col4)
   added: (is-blank row1 col4) (is-removed tile13) (tile-removed)
   goals met: 8 of 15
19. (reinsert-tile tile13 row3 col1)
   deleted: (is-blank row3 col1) (is-removed tile13) (tile-removed)
   added: (tile-at tile13 row3 col1)
   goals met: 8 of 15
20. (remove-tile tile15 row4 col1)
   deleted: (tile-at tile15 row4 col1)
   added: (is-blank row4 col1) (is-removed tile15) (tile-removed)
   goals met: 8 of 15
21. (move-tile-down tile13 row3 row4 col1)
   deleted: (tile-at tile13 row3 col1) (is-blank row4 col1)
   added: (tile-at tile13 row4 col1) (is-blank row3 col1)
   goals met: 9 of 15
22. (reinsert-tile tile15 row3 col1)
   deleted: (is-blank row3 col1) (is-removed tile15) (tile-removed)
   added: (tile-at tile15 row3 col1)
   goals met: 9 of 15
23. (remove-tile tile4 row3 col2)
   deleted: (tile-at tile4 row3 col2)
   added: (is-blank row3 col2) (is-removed tile4) (tile-removed)
   goals met: 9 of 15
24. (reinsert-tile tile4 row1 col4)
   deleted: (is-blank row1 col4) (is-removed tile4) (tile-removed)
   added: (tile-at tile4 row1 col4)
   goals met: 10 of 15
25. (remove-tile tile10 row4 col3)
   deleted: (tile-at tile10 row4 col3)
   added: (is-blank row4 col3) (is-removed tile10) (tile-removed)
   goals met: 10 of 15
26. (reinsert-tile tile10 row3 col2)
   deleted: (is-blank row3 col2) (is-removed tile10) (tile-removed)
   added: (tile-at tile10 row3 col2)
   goals met: 11 of 15
27. (remove-tile tile15 row3 col1)
   deleted: (tile-at tile15 row3 col1)
   added: (is-blank row3 col1) (is-removed tile15) (tile-removed)
   goals met: 11 of 15
28. (reinsert-tile tile15 row4 col3)
   deleted: (is-blank row4 col3) (is-removed tile15) (tile-removed)
   added: (tile-at tile15 row4 col3)
   goals met: 12 of 15
29. (remove-tile tile9 row1 col1)
   deleted: (tile-at tile9 row1 col1)
   added: (is-blank row1 col1) (is-removed tile9) (tile-removed)
   goals met: 12 of 15
30. (reinsert-tile tile9 row3 col1)
   deleted: (is-blank row3 col1) (is-removed tile9) (tile-removed)
   added: (tile-at tile9 row3 col1)
   goals met: 13 of 15
31. (remove-tile tile1 row2 col4)
   deleted: (tile-at tile1 row2 col4)
   added: (is-blank row2 col4) (is-removed tile1) (tile-removed)
   goals met: 13 of 15
32. (reinsert-tile tile1 row1 col1)
   deleted: (is-blank row1 col1) (is-removed tile1) (tile-removed)
   added: (tile-at tile1 row1 col1)
   goals met: 14 of 15
33. (remove-tile tile8 row4 col4)
   deleted: (tile-at tile8 row4 col4)
   added: (is-blank row4 col4) (is-removed tile8) (tile-removed)
   goals met: 14 of 15
34. (reinsert-tile tile8 row2 col4)
   deleted: (is-blank row2 col4) (is-removed tile8) (tile-removed)
   added: (tile-at tile8 row2 col4)
   goals met: 15 of 15
